desafio/app/Dao/FilaDao.php

SELECT *
FROM `sala`
SELECT *
FROM `fila`
WHERE `fila`.`fila_id` = '101'
---
    public function getValorMenor() {
        $db      = db_connect();
        $id = $this->sala->findAll();

        foreach($id as $ids){
        $query = $db->query('SELECT MIN(fila_id) AS min_fila_id from fila where fila_status = 1 and Date(fila_data) = CURDATE() and fila_sala_id ='. $ids->sala_id);
        $result = $query->getRow();

                if($result->min_fila_id !== null){
                   // var_dump($result->min_fila_id);
                    $fi =  $this->fila->find($result->min_fila_id);