desafio/app/Controllers/FilaController.php

SELECT *
FROM `Sala`
WHERE `Sala`.`sala_id` = '2'
SELECT *
FROM `sala`
WHERE `sala`.`sala_id` = '1'
---
    public function getFila(){

        date_default_timezone_set('America/Sao_Paulo');

        $valor = new FilaDao();
        $datas['sala'] = $this->sala->findAll();




       // $val = $resultado;
      //  var_dump($val);
        $value = $valor->getValorMenor();
        //var_dump($value);

            foreach($value as $vs){
              //  var_dump($vs);
                $valorSala = $this->sala->find($vs['sala']) ;

SELECT *
FROM `fila`
WHERE `fila`.`fila_id` = '18'
UPDATE `fila` SET `fila_status` = 0
WHERE `fila_id` = '18'
SELECT *
FROM `sala`
WHERE `sala`.`sala_id` = '1'
---
    public function proximo($id){
        // pegaria o proxima_sala. ou seja, o atual seria colocado status 0 e adicionado o proximo com a sala que deverá receber o novo atendente.
        $filas = $this->fila->find($id);
       // var_dump($filas);
        $datas = [
            'filas_status' => 0
        ];
        $this->fila->set('fila_status', 0);
        $this->fila->where('fila_id', $filas->fila_id);
        $this->fila->update();
        $user = new UsuarioDao();
               $user = $user->getSalas();
                foreach($user as $vs){

                $valorSala = $this->sala->find($vs['sala']) ;