desafio/app/Controllers/FilaController.php

    public function jsonLista(){
                 date_default_timezone_set('America/Sao_Paulo');

          $valor = new FilaDao();
        $datas['sala'] = $this->sala->findAll();
---
SELECT *
FROM `sala`