desafio/app/Controllers/SalaController.php

SELECT *
FROM `Sala`
---
    public function buscarSala() : Array
    {
         return $this->sala->findAll();