desafio/app/Controllers/UsuarioController.php

SELECT *
FROM `sala`
WHERE `sala`.`sala_id` = '1'
---
    public function login(){
        $nome = $_POST['usuario'];
        $senha = $_POST['senha'];
        if(empty($nome)){
            $data['msg'] = msg('Usuario está vazio','danger');
            return view('/usuario_layout.php', $data);
        }else if(empty($senha)){
            $data['msg'] = msg('Senha está vazia','danger');
            return view('/usuario_layout.php', $data);
        }else{
            $senha = md5($senha);
            $where = array('login_nome' => $nome, 'login_senha' => $senha);
            $value = $this->user->where($where)->first();

            if($value !==null && !empty($value)){
                $session = session();
                $session->set('nome', $value->login_nome);
                $session->set('sala', $value->login_sala_id);
                $user = new UsuarioDao();
               $user = $user->getSalas();
               if($user == "NULL"){
                    $datas['resultado'] = "NULL";
               }else{
                foreach($user as $vs){

                $valorSala = $this->sala->find($vs['sala']) ;

SELECT *
FROM `sala`
WHERE `sala`.`sala_id` = '1'
---
    public function jsonUser(){
                 date_default_timezone_set('America/Sao_Paulo');

                $user = new UsuarioDao();
               $usuarios = $user->getSalas();
               //var_dump($usuarios);
               if($usuarios == "NULL"){
                $rs[] = [
                    'null' => 'NULL'
                ];
                    return $this->response->setjson($rs);

               }else{
                foreach($usuarios as $vs){

                $valorSala = $this->sala->find($vs['sala']) ;